#include <iostream>
#include <ctime>
#include <conio.h>
#include "BetterPrint.h"
using namespace std;

void PRINTUP(int x, int y)
{
	int UP[4][14] = {
		{0,0,0,0,0,0,1,1,0,0,0,0,0,0},
		{0,0,0,0,1,1,0,0,1,1,0,0,0,0},
		{0,0,1,1,0,0,0,0,0,0,1,1,0,0},
		{1,1,0,0,0,0,0,0,0,0,0,0,1,1},
	};

	for (int i = 0; i < 4; i++)
	{
		for (int j = 0; j < 14; j++)
		{
			if (UP[i][j] == 1)
			{
				MoveCursor(j + x, i + y);
				printf("#");
			}
		}
	}
}

void PRINTDOWN(int x, int y)
{
	{
		int UP[4][14] = {
			{1,1,0,0,0,0,0,0,0,0,0,0,1,1},
			{0,0,1,1,0,0,0,0,0,0,1,1,0,0},
			{0,0,0,0,1,1,0,0,1,1,0,0,0,0},
			{0,0,0,0,0,0,1,1,0,0,0,0,0,0},
		};

		for (int i = 0; i < 4; i++)
		{
			for (int j = 0; j < 14; j++)
			{
				if (UP[i][j] == 1)
				{
					MoveCursor(j + x, i + y);
					printf("#");
				}
			}
		}
	}
}

void PRINTNUM(int x, int y, int num)
{
	int NUM1[7][8] = {
		{0,0,0,1,1,0,0,0},
		{0,1,1,1,1,0,0,0},
		{0,0,0,1,1,0,0,0},
		{0,0,0,1,1,0,0,0},
		{0,0,0,1,1,0,0,0},
		{0,0,0,1,1,0,0,0},
		{0,1,1,1,1,1,1,0}
	};
	int NUM2[7][8] = {
		{1,1,1,1,1,1,1,1},
		{0,0,0,0,0,0,0,1},
		{0,0,0,0,0,0,0,1},
		{1,1,1,1,1,1,1,1},
		{1,0,0,0,0,0,0,0},
		{1,0,0,0,0,0,0,0},
		{1,1,1,1,1,1,1,1}
	};
	int NUM3[7][8] = {
		{1,1,1,1,1,1,1,1},
		{0,0,0,0,0,0,0,1},
		{0,0,0,0,0,0,0,1},
		{1,1,1,1,1,1,1,1},
		{0,0,0,0,0,0,0,1},
		{0,0,0,0,0,0,0,1},
		{1,1,1,1,1,1,1,1}
	};
	int NUM4[7][8] = {
		{1,0,0,0,0,0,0,1},
		{1,0,0,0,0,0,0,1},
		{1,0,0,0,0,0,0,1},
		{1,1,1,1,1,1,1,1},
		{0,0,0,0,0,0,0,1},
		{0,0,0,0,0,0,0,1},
		{0,0,0,0,0,0,0,1}
	};
	int NUM5[7][8] = {
		{1,1,1,1,1,1,1,1},
		{1,0,0,0,0,0,0,0},
		{1,0,0,0,0,0,0,0},
		{1,1,1,1,1,1,1,1},
		{0,0,0,0,0,0,0,1},
		{0,0,0,0,0,0,0,1},
		{1,1,1,1,1,1,1,1}
	};
	int NUM6[7][8] = {
		{1,1,1,1,1,1,1,1},
		{1,0,0,0,0,0,0,0},
		{1,0,0,0,0,0,0,0},
		{1,1,1,1,1,1,1,1},
		{1,0,0,0,0,0,0,1},
		{1,0,0,0,0,0,0,1},
		{1,1,1,1,1,1,1,1}
	};
	int NUM7[7][8] = {
		{1,1,1,1,1,1,1,1},
		{0,0,0,0,0,0,1,1},
		{0,0,0,0,0,1,1,0},
		{0,0,0,1,1,0,0,0},
		{0,0,0,1,1,0,0,0},
		{0,0,0,1,1,0,0,0},
		{0,0,0,1,1,0,0,0}
	};
	int NUM8[7][8] = {
		{1,1,1,1,1,1,1,1},
		{1,0,0,0,0,0,0,1},
		{1,0,0,0,0,0,0,1},
		{1,1,1,1,1,1,1,1},
		{1,0,0,0,0,0,0,1},
		{1,0,0,0,0,0,0,1},
		{1,1,1,1,1,1,1,1}
	};
	int NUM9[7][8] = {
		{1,1,1,1,1,1,1,1},
		{1,0,0,0,0,0,0,1},
		{1,0,0,0,0,0,0,1},
		{1,1,1,1,1,1,1,1},
		{0,0,0,0,0,0,0,1},
		{0,0,0,0,0,0,0,1},
		{1,1,1,1,1,1,1,1}
	};

	int* NUM_P[] = {
		NUM1[0],
		NUM2[0],
		NUM3[0],
		NUM4[0],
		NUM5[0],
		NUM6[0],
		NUM7[0],
		NUM8[0],
		NUM9[0],
	};

	for (int i = 0; i < 7; i++)
	{
		for (int j = 0; j < 8; j++)
		{
			if (*(NUM_P[num - 1] + i * 8 + j) == 1)
			{
				MoveCursor(x + j, y + i);
				printf("#");
			}
		}
	}
};

void FILL(int x1, int y1, int x2, int y2, char ch)
{
	for (int i = y1; i < y2; i++)
	{
		for (int j = x1; j < x2; j++)
		{
			MoveCursor(j, i);
			printf("%c", ch);
		}
	}
}

void Contral(int dirction)
{
	//1:向上，2:向下
	if (dirction == 1)
	{
		system("cls");
		system("title 电梯正在上升");
		srand((unsigned int)time(NULL));
		int num = rand() % 15 + 1;
		SetFontColor(num);
		int floor = 1;
		while (floor < 10)
		{
			PRINTNUM(13, 12, floor);
			for (int i = 6; i >= 0; i--)
			{
				FILL(10, 0, 24, 10, ' ');
				PRINTUP(10, i);
				Sleep(100);
			}
			FILL(13, 12, 21, 19, ' ');
			floor++;
		}
		system("cls");
		system("title 电梯已停止");
		printf("等待命令...");
	}
	else
	{
		system("cls");
		system("title 电梯正在下降");
		srand((unsigned int)time(NULL));
		int num = rand() % 15 + 1;
		SetFontColor(num);
		int floor = 9;
		while (floor > 0)
		{
			PRINTNUM(13, 12, floor);
			for (int i = 0; i <= 6; i++)
			{
				FILL(10, 0, 24, 10, ' ');
				PRINTDOWN(10, i);
				Sleep(100);
			}
			FILL(13, 12, 21, 19, ' ');
			floor--;
		}
		system("cls");
		system("title 电梯已停止");
		printf("等待命令...");
	}
}

int main()
{
	printf("当出现\"等待命令...\"时，使用方向键的'↑'和'↓'控制电梯上下，回车退出\n");
	printf("等待命令...");
	while (_getch() != 13)
	{
		switch (_getch())
		{
		case 72:
			Contral(1);
			break;
		case 80:
			Contral(2);
			break;
		default:
			printf("无效的按键");
			break;
		}
	}
}